namespace GMTool;

public class DnfHelper
{
	public static string GetCharGrowType(int Job, int GrowType)
	{
		return Job switch
		{
			0 => GrowType switch
			{
				1 => "剑魂", 
				17 => "剑圣", 
				2 => "鬼泣", 
				18 => "弑魂", 
				3 => "狂战士", 
				19 => "狱血魔神", 
				4 => "阿修罗", 
				20 => "大暗黑天", 
				_ => "鬼剑士", 
			}, 
			1 => GrowType switch
			{
				1 => "气功师", 
				17 => "百花缭乱", 
				2 => "散打", 
				18 => "武神", 
				3 => "街霸", 
				19 => "毒王", 
				4 => "柔道家", 
				20 => "暴风眼", 
				_ => "格斗家-女", 
			}, 
			2 => GrowType switch
			{
				1 => "漫游枪手", 
				17 => "枪神", 
				2 => "枪炮师", 
				18 => "狂暴者", 
				3 => "机械师", 
				19 => "机械战神", 
				4 => "弹药专家", 
				20 => "大将军", 
				_ => "神枪手-男", 
			}, 
			3 => GrowType switch
			{
				1 => "元素师", 
				17 => "大魔导师", 
				2 => "召唤师", 
				18 => "月之女皇", 
				3 => "战斗法师", 
				19 => "贝亚娜斗神", 
				4 => "魔道学者", 
				20 => "魔术师", 
				_ => "魔法师-女", 
			}, 
			4 => GrowType switch
			{
				1 => "圣骑士", 
				17 => "天启者", 
				2 => "蓝拳圣使", 
				18 => "神之手", 
				3 => "驱魔师", 
				19 => "龙斗士", 
				4 => "复仇者", 
				20 => "末日守护者", 
				_ => "圣职者-男", 
			}, 
			5 => GrowType switch
			{
				1 => "漫游枪手", 
				17 => "沾血蔷薇", 
				2 => "枪炮师", 
				18 => "重炮掌控者", 
				3 => "机械师", 
				19 => "机械之心", 
				4 => "弹药专家", 
				20 => "战争女神", 
				_ => "神枪手-女", 
			}, 
			6 => GrowType switch
			{
				1 => "刺客", 
				17 => "银月", 
				2 => "死灵术士", 
				18 => "灵魂收割者", 
				_ => "暗夜使者", 
			}, 
			7 => GrowType switch
			{
				1 => "气功师", 
				17 => "狂虎帝", 
				2 => "散打", 
				18 => "武极", 
				3 => "街霸", 
				19 => "千手罗汉", 
				4 => "柔道家", 
				20 => "风林火山", 
				_ => "格斗家-男", 
			}, 
			8 => GrowType switch
			{
				1 => "元素爆破师", 
				17 => "魔皇", 
				2 => "冰洁师", 
				18 => "冰冻之心", 
				_ => "魔法师-男", 
			}, 
			9 => "暗黑武士", 
			10 => "缔造者", 
			_ => "未知职业", 
		};
	}
}
